# Taps
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "justintime50/formulas"
tap "microsoft/git"
tap "shivammathur/php"
# Packages
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "cjson"
brew "cmocka"
brew "composer"
brew "cronic"
brew "curl"
brew "dav1d"
brew "emacs"
brew "ffmpeg"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "guile"
brew "harfbuzz"
brew "hey"
brew "highway"
brew "httpd"
brew "icu4c"
brew "imath"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "just"
brew "keychain"
brew "krb5"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libev"
brew "libevent"
brew "libffi"
brew "libidn"
brew "libidn2"
brew "libmetalink"
brew "libnghttp2"
brew "libogg"
brew "libpng"
brew "libpq"
brew "libpthread-stubs"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libzip"
brew "little-cms2"
brew "luajit"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mbedtls"
brew "mpdecimal"
brew "mpg123"
brew "msgpack"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "node"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre"
brew "pcre2"
brew "php"
brew "pixman"
brew "pkg-config"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "rav1e"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "sqlite"
brew "srt"
brew "srvinfra"
brew "svt-av1"
brew "tcl-tk"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "tokei"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "webp"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "zeromq"
brew "zimg"
brew "zstd"
# Casks
cask_args appdir: "~/Applications"
cask "1password"
cask "backblaze"
cask "docker"
cask "emacs"
cask "git-credential-manager-core"
cask "handbrake"
cask "iterm2"
cask "makemkv"
cask "smcfancontrol"
cask "sublime-text"
cask "teamviewer"
