# Taps
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "justintime50/formulas"
# Packages
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "brotli"
brew "c-ares"
brew "cairo"
brew "curl"
brew "curl-openssl"
brew "dav1d"
brew "ffmpeg"
brew "flac"
brew "fontconfig"
brew "freedom"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "guile"
brew "harfbuzz"
brew "icu4c"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "keychain"
brew "krb5"
brew "lame"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libev"
brew "libevent"
brew "libffi"
brew "libidn"
brew "libidn2"
brew "libmetalink"
brew "libogg"
brew "libpng"
brew "libpq"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libvidstab"
brew "libvorbis"
brew "libvpx"
brew "libzip"
brew "little-cms2"
brew "lzo"
brew "nettle"
brew "nghttp2"
brew "node"
brew "oniguruma"
brew "opencore-amr"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "opus"
brew "p11-kit"
brew "pcre"
brew "pcre2"
brew "php"
brew "pixman"
brew "pkg-config"
brew "python@3.8"
brew "python@3.9"
brew "rav1e"
brew "readline"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "sqlite"
brew "srt"
brew "tcl-tk"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "unbound"
brew "unixodbc"
brew "webp"
brew "x264"
brew "x265"
brew "xvid"
brew "xz"
brew "zeromq"
brew "zimg"
brew "zstd"
# Casks
cask_args appdir: "~/Applications", require_sha: true
cask "backblaze"
cask "ccleaner"
cask "docker"
cask "emacs"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "makemkv"
cask "smcfancontrol"
cask "sublime-text"
cask "teamviewer"
