# Taps
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "justintime50/formulas"
tap "microsoft/git"
tap "shivammathur/php"
tap "silinternational/tap"
tap "tilt-dev/tap"
# Packages
brew "act"
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "awscli"
brew "bdw-gc"
brew "bison"
brew "brew-gem"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "composer"
brew "curl"
brew "dav1d"
brew "dnsmasq"
brew "ecs-deploy"
brew "ffmpeg"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "giflib"
brew "git"
brew "git-filter-repo"
brew "glib"
brew "glow"
brew "gmp"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "grep"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "httpd"
brew "icu4c"
brew "imath"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "keychain"
brew "krb5"
brew "kustomize"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libev"
brew "libevent"
brew "libffi"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libmetalink"
brew "libnghttp2"
brew "libogg"
brew "libpng"
brew "libpq"
brew "libpthread-stubs"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "luajit"
brew "luv"
brew "lxc"
brew "lz4"
brew "lzo"
brew "m4"
brew "maven"
brew "mbedtls"
brew "mcrypt"
brew "mhash"
brew "mpdecimal"
brew "msgpack"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "node"
brew "onepass"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "opus"
brew "p11-kit"
brew "pcre"
brew "pcre2"
brew "php"
brew "pixman"
brew "pkg-config"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "rav1e"
brew "re2c"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "sdl2"
brew "shellcheck"
brew "shfmt"
brew "six"
brew "snap"
brew "snapcraft"
brew "snappy"
brew "speex"
brew "sqlite"
brew "squashfs"
brew "srt"
brew "tcl-tk"
brew "tesseract"
brew "the_silver_searcher"
brew "theora"
brew "tidy-html5"
brew "tilt"
brew "tokei"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "webp"
brew "wget"
brew "x264"
brew "x265"
brew "xdelta"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yarn"
brew "zeromq"
brew "zimg"
brew "zstd"
# Casks
cask_args appdir: "~/Applications"
cask "1password"
cask "1password-cli"
cask "backblaze"
cask "battle-net"
cask "chromedriver"
cask "emacs"
cask "gimp"
cask "git-credential-manager-core"
cask "makemkv"
cask "mattermost"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "teamviewer"
cask "ultimaker-cura"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "xquartz"
cask "zoom"
