# Taps
tap "justintime50/formulas"
tap "shivammathur/php"
tap "silinternational/tap"
tap "tilt-dev/tap"
# Packages
brew "act"
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "brew-gem"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cffi"
brew "cjson"
brew "clienv"
brew "cmake"
brew "composer"
brew "cryptography"
brew "curl"
brew "cyrus-sasl"
brew "dav1d"
brew "ffmpeg"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "gh"
brew "giflib"
brew "git"
brew "git-filter-repo"
brew "github-archive"
brew "glib"
brew "glow"
brew "gmp"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "graphite2"
brew "grep"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "hey"
brew "highway"
brew "htop"
brew "icu4c@75"
brew "icu4c@76"
brew "icu4c@77"
brew "icu4c@78"
brew "imagemagick"
brew "imath"
brew "jansson"
brew "jasper"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "just"
brew "k6"
brew "keychain"
brew "krb5"
brew "kustomize"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgit2"
brew "libgit2@1.7"
brew "libheif"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "liblinear"
brew "liblqr"
brew "libmetalink"
brew "libmicrohttpd"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libraw"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libudfread"
brew "libunibreak"
brew "libunistring"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "logrotate"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luv"
brew "lxc"
brew "lz4"
brew "lzo"
brew "m4"
brew "maven"
brew "mbedtls"
brew "mbedtls@3"
brew "mpdecimal"
brew "mpg123"
brew "msgpack"
brew "muffinscript"
brew "ncurses"
brew "neovim"
brew "net-snmp"
brew "nettle"
brew "nghttp2"
brew "nginx"
brew "nmap"
brew "node"
brew "node@22"
brew "onepass"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openjph"
brew "openldap"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre"
brew "pcre2"
brew "php"
brew "php@8.1"
brew "php@8.2"
brew "php@8.3"
brew "php@8.4"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "popt"
brew "pycparser"
brew "pydantic"
brew "pydantic-core"
brew "pyenv"
brew "pygit2"
brew "python-packaging"
brew "python@3.10"
brew "python@3.13"
brew "python@3.14"
brew "rav1e"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "sdl2"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "simdjson"
brew "simdutf"
brew "snap"
brew "snapcraft"
brew "snappy"
brew "speex"
brew "sqlite"
brew "squashfs"
brew "srt"
brew "stripe-cli"
brew "svt-av1"
brew "swiftlint"
brew "tcl-tk"
brew "telnet"
brew "tesseract"
brew "the_silver_searcher"
brew "theora"
brew "tidy-html5"
brew "tilt"
brew "tmux"
brew "tokei"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "utf8proc"
brew "uvwasi"
brew "webp"
brew "wget"
brew "wrk"
brew "x264"
brew "x265"
brew "xdelta"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yarn"
brew "zeromq"
brew "zimg"
brew "zstd"
# Casks
cask_args appdir: "~/Applications"
cask "1password"
cask "1password-cli"
cask "balenaetcher"
cask "bambu-studio"
cask "battle-net"
cask "burp-suite"
cask "discord"
cask "docker"
cask "docker-desktop"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "handbrake-app"
cask "inkscape"
cask "makemkv"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "ollama"
cask "postman"
cask "slack"
cask "unifi-identity-endpoint"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"
