# Taps
tap "cdzombak/oss"
tap "fwartner/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"
tap "justintime50/formulas"
tap "shivammathur/php"
# Packages
brew "act"
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "brew-gem"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "clienv"
brew "composer"
brew "cronic"
brew "curl"
brew "cyrus-sasl"
brew "dav1d"
brew "dcraw"
brew "deno"
brew "dive"
brew "dnsmasq"
brew "docbook"
brew "docbook-xsl"
brew "easypost-cli"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "fribidi"
brew "gd"
brew "gdbm"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "goreleaser"
brew "gosec"
brew "graphite2"
brew "grep"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "httpd"
brew "icu4c@76"
brew "icu4c@77"
brew "icu4c@78"
brew "imagemagick"
brew "imath"
brew "jansson"
brew "jasper"
brew "jbig2dec"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "just"
brew "keychain"
brew "krb5"
brew "leptonica"
brew "libarchive"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libde265"
brew "libdeflate"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmetalink"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libraw"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libultrahdr"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lua"
brew "lz4"
brew "lzo"
brew "m4"
brew "macos-term-size"
brew "maven"
brew "mpdecimal"
brew "ncurses"
brew "net-snmp"
brew "nettle"
brew "nghttp2"
brew "node"
brew "npth"
brew "onepass"
brew "oniguruma"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openjph"
brew "openldap"
brew "openssl@3"
brew "p11-kit"
brew "pango"
brew "pcre"
brew "pcre2"
brew "pgcopydb"
brew "php"
brew "php@8.1"
brew "php@8.2"
brew "php@8.3"
brew "pinentry"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "postgresql@17"
brew "pv"
brew "pyenv"
brew "python-packaging"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rtmpdump"
brew "ruby"
brew "runner"
brew "rustup"
brew "rustup-init"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "simdjson"
brew "sqlite"
brew "swiftlint"
brew "tcl-tk"
brew "tesseract"
brew "tidy-html5"
brew "tmux"
brew "tokei"
brew "unbound"
brew "unixodbc"
brew "utf8proc"
brew "uvwasi"
brew "vim"
brew "webp"
brew "wget"
brew "x265"
brew "xmlto"
brew "xorgproto"
brew "xz"
brew "zbar"
brew "zstd"
# Casks
cask_args appdir: "~/Applications"
cask "docker"
cask "docker-desktop"
cask "ghostty"
cask "gimp"
cask "imageoptim"
cask "microsoft-auto-update"
cask "ngrok"
cask "postman"
cask "visual-studio-code"
cask "zulu@21"
