# Taps
tap "easypost/easypost"
tap "fwartner/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "justintime50/formulas"
# Packages
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "arcanist"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "brew-gem"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "curl"
brew "dcraw"
brew "docbook"
brew "docbook-xsl"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "gd"
brew "gdbm"
brew "gettext"
brew "ghostscript"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "gradle"
brew "grep"
brew "guile"
brew "hadolint"
brew "icu4c"
brew "imagemagick"
brew "imath"
brew "jansson"
brew "jasper"
brew "jbig2dec"
brew "jemalloc"
brew "jpeg"
brew "jpeg-xl"
brew "jq"
brew "keychain"
brew "krb5"
brew "libde265"
brew "libev"
brew "libevent"
brew "libffi"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "liblqr"
brew "libmetalink"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvmaf"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "m4"
brew "macos-term-size"
brew "maven"
brew "mpdecimal"
brew "ncurses"
brew "nettle"
brew "nghttp2"
brew "node"
brew "node@14"
brew "onepass"
brew "oniguruma"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "p11-kit"
brew "pcre"
brew "pcre2"
brew "php"
brew "php@7.4"
brew "pkg-config"
brew "python@3.8"
brew "python@3.9"
brew "readline"
brew "rtmpdump"
brew "ruby"
brew "rust"
brew "shared-mime-info"
brew "shellcheck"
brew "sqlite"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tidy-html5"
brew "travis"
brew "ufraw"
brew "unbound"
brew "unixodbc"
brew "webp"
brew "x265"
brew "xmlto"
brew "xz"
brew "zbar"
brew "zstd"
# Casks
cask_args appdir: "~/Applications", require_sha: true
cask "adoptopenjdk"
cask "aerial"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "emacs"
cask "freedom"
cask "gimp"
cask "imageoptim"
cask "iterm2"
cask "postman"
cask "slack"
cask "visual-studio-code"
