# Taps
tap "fwartner/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "justintime50/formulas"
tap "microsoft/git"
tap "shivammathur/php"
# Packages
brew "act"
brew "alchemist"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "bdw-gc"
brew "berkeley-db"
brew "bison"
brew "brew-gem"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "clienv"
brew "composer"
brew "curl"
brew "dcraw"
brew "deno"
brew "dnsmasq"
brew "docbook"
brew "docbook-xsl"
brew "easypost-cli"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "gd"
brew "gdbm"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "gosec"
brew "gradle"
brew "graphite2"
brew "grep"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "hey"
brew "highway"
brew "htop"
brew "httpd"
brew "icu4c"
brew "imagemagick"
brew "imath"
brew "jansson"
brew "jasper"
brew "jbig2dec"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "keychain"
brew "krb5"
brew "libassuan"
brew "libavif"
brew "libde265"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmetalink"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libpthread-stubs"
brew "libraw"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lua"
brew "luajit"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "macos-term-size"
brew "maven"
brew "mpdecimal"
brew "msgpack"
brew "ncurses"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "node"
brew "node@14"
brew "node@16"
brew "npth"
brew "onepass"
brew "oniguruma"
brew "openexr"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "openssl@3"
brew "p11-kit"
brew "pcre"
brew "pcre2"
brew "perl"
brew "php"
brew "php@7.3"
brew "php@7.4"
brew "php@8.0"
brew "php@8.1"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "re2c"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "ruby"
brew "ruby@2.7"
brew "ruby@3.0"
brew "rust"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "swagger-codegen"
brew "swiftlint"
brew "tcl-tk"
brew "tidy-html5"
brew "tokei"
brew "travis"
brew "tree-sitter"
brew "ufraw"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "vim"
brew "webp"
brew "wget"
brew "x265"
brew "xmlto"
brew "xorgproto"
brew "xz"
brew "zbar"
brew "zstd"
# Casks
cask_args appdir: "~/Applications"
cask "1password"
cask "adoptopenjdk"
cask "aerial"
cask "anaconda"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "emacs"
cask "freedom"
cask "gimp"
cask "git-credential-manager-core"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "mono-mdk-for-visual-studio"
cask "postman"
cask "visual-studio-code"
cask "vmware-fusion"
